podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/C_CAN_LPC11Cxx.svd.xml
<!--
Devices using this peripheral: 
      LPC11Cxx
-->
      <peripheral>
         <?sourceFile "C_CAN_LPC11Cxx" ?>
         <name>C_CAN</name>
         <description>C_CAN controller</description>
         <groupName>C_CAN</groupName>
         <headerStructName>C_CAN</headerStructName>
         <baseAddress>0x40050000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0x2C</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x2C</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x120</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x140</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x160</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x180</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CANCNTL</name>
               <description>CAN control</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initialization</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORMAL_OPERATION</name>
                           <description>Normal operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INITIALIZATION_IS_ST</name>
                           <description>Initialization is started. On reset, software needs to initialize the CAN controller</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>Module interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_CAN_INTERRUP</name>
                           <description>Disable CAN interrupts. The interrupt line is always HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_CAN_INTERRUPT</name>
                           <description>Enable CAN interrupts. The interrupt line is set to LOW and remains LOW until all pending interrupts are cleared</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIE</name>
                     <description>Status change interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_STATUS_CHANG</name>
                           <description>Disable status change interrupts. No status change interrupt will be generated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_STATUS_CHANGE</name>
                           <description>Enable status change interrupts. A status change interrupt will be generated when a message transfer is successfully completed or a CAN bus error is detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_ERROR_INTERR</name>
                           <description>Disable error interrupt. No error status interrupt will be generated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_ERROR_INTERRU</name>
                           <description>Enable error interrupt. A change in the bits BOFF or EWARN in the CANSTAT registers will generate an interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAR</name>
                     <description>Disable automatic retransmission</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>AUTOMATIC_RETRANSMIS</name>
                           <description>Automatic retransmission of disturbed messages enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTOMATIC_RETRANSMIS</name>
                           <description>Automatic retransmission disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>Configuration change enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THE_CPU_HAS_NO_WRITE</name>
                           <description>The CPU has no write access to the bit timing register</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THE_CPU_HAS_WRITE_AC</name>
                           <description>The CPU has write access to the CANBT register while the INIT bit is one</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENUM</name>
                     <description>Test mode enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORMAL_OPERATION</name>
                           <description>Normal operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TEST_MODE</name>
                           <description>Test mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANSTAT</name>
               <description>Status register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>LEC</name>
                     <description>Last error code Type of the last error to occur on the CAN bus.The LEC field holds a code which indicates the type of the last error to occur on the CAN bus. This field will be cleared to 0 when a message has been transferred (reception or transmission) without error. The unused code 111 may be written by the CPU to check for updates</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_ERROR</name>
                           <description>No error</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF_ERROR_MORE_TH</name>
                           <description>Stuff error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM_ERROR_A_FIXED</name>
                           <description>Form error: A fixed format part of a received frame has the wrong format</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACKERROR_THE_MESSAG</name>
                           <description>AckError: The message this CAN core transmitted was not acknowledged</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1ERROR_DURING_TH</name>
                           <description>Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a HIGH/recessive level (bit of logical value 1), but the monitored bus value was LOW/dominant</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0ERROR_DURING_TH</name>
                           <description>Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a LOW/dominant level (data or identifier bit logical value 0), but the monitored Bus value was HIGH/recessive. During busoff recovery this status is set each time a sequence of 11 HIGH/recessive bits has been monitored. This enables the CPU to monitor the proceeding of the busoff recovery sequence (indicating the bus is not stuck at LOW/dominant or continuously disturbed)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRCERROR_THE_CRC_CH</name>
                           <description>CRCError: The CRC checksum was incorrect in the message received</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNUSED_NO_CAN_BUS_E</name>
                           <description>Unused: No CAN bus event was detected (written by the CPU)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXOK</name>
                     <description>Transmitted a message successfully This bit must be reset by the CPU. It is never reset by the CAN controller</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_TRANSMIT</name>
                           <description>No transmit. Since this bit was last reset by the CPU, no message has been successfully transmitted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUCCESSFUL_TRANSMIT</name>
                           <description>Successful transmit. Since this bit was last reset by the CPU, a message has been successfully transmitted (error free and acknowledged by at least one other node)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXOK</name>
                     <description>Received a message successfully This bit must be reset by the CPU. It is never reset by the CAN controller</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RECEIVE</name>
                           <description>No receive. Since this bit was last reset by the CPU, no message has been successfully received</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUCCESSFUL_RECEIVE</name>
                           <description>Successful receive.Since this bit was last set to zero by the CPU, a message has been successfully received independent of the result of acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EPASS</name>
                     <description>Error passive</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>Active. The CAN controller is in the error active state</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PASSIVE</name>
                           <description>Passive. The CAN controller is in the error passive state as defined in the CAN 2.0 specification</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EWARN</name>
                     <description>Warning status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BELOW_LIMIT</name>
                           <description>Below limit. Both error counters are below the error warning limit of 96</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AT_LIMIT</name>
                           <description>At limit. At least one of the error counters in the EC has reached the error warning limit of 96</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOFF</name>
                     <description>Busoff status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THE_CAN_MODULE_IS_NO</name>
                           <description>The CAN module is not in busoff</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THE_CAN_CONTROLLER_I</name>
                           <description>The CAN controller is in busoff state</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANEC</name>
               <description>Error counter</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEC7_0</name>
                     <description>Transmit error counter Current value of the transmit error counter (maximum value 255)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REC6_0</name>
                     <description>Receive error counter Current value of the receive error counter (maximum value 127)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>RP</name>
                     <description>Receive error passive</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THE_RECEIVE_COUNTER</name>
                           <description>The receive counter is below the error passive level</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THE_RECEIVE_COUNTER</name>
                           <description>The receive counter has reached the error passive level as defined in the  CAN2.0 specification</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANBT</name>
               <description>Bit timing register</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x2301</resetValue>
               <fields>
                  <field>
                     <name>BRP</name>
                     <description>Baud rate prescaler The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Baud Rate Prescaler are 0 to 63.[1]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SJW</name>
                     <description>(Re)synchronization jump width Valid programmed values are 0 to 3.[1]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TSEG1</name>
                     <description>Time segment before the sample point Valid values are 1 to 15.[1]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TSEG2</name>
                     <description>Time segment after the sample point Valid values are 0 to 7.[1]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANINT</name>
               <description>Interrupt register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>0x0000 = No interrupt is pending. 0x0001 - 0x0020 = Number of message object which caused the interrupt. 0x0021 - 0x7FFF = Unused 0x8000 = Status interrupt 0x8001 - 0xFFFF = Unused</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
