podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/C_CAN_LPC11Cxx.svd.xml
            <register>
               <name>CANIF1_MSK2</name>
               <description>Message interface 1 mask 2</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>MSK28_16</name>
                     <description>Identifier mask [28:16]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MATCH</name>
                           <description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Mask. The corresponding identifier bit is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDIR</name>
                     <description>Mask message direction</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>WITHOUT_DIR_BIT</name>
                           <description>Without DIR bit. The message direction bit (DIR) has no effect on acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WITH_DIR_BIT</name>
                           <description>With DIR bit. The message direction bit (DIR) is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MXTD</name>
                     <description>Mask extend identifier</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>WITHOUT_XTD</name>
                           <description>Without XTD. The extended identifier bit (XTD) has no effect on acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WITH_XTD</name>
                           <description>With XTD. The extended identifier bit (XTD) is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_ARB1</name>
               <description>Message interface 1 arbitration 1</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>ID15_0</name>
                     <description>Message identifier [15:0] 29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_ARB2</name>
               <description>Message interface 1 arbitration 2</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>ID28_16</name>
                     <description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Message direction</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RECEIVE</name>
                           <description>Receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TANSMIT</name>
                           <description>Tansmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XTD</name>
                     <description>Extend identifier</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD</name>
                           <description>Standard. The 11-bit standard identifier will be used for this message object</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXTENDED</name>
                           <description>Extended. The 29-bit extended identifier will be used for this message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSGVAL</name>
                     <description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INVALID</name>
                           <description>Invalid. The message object is ignored by the message handler</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALID</name>
                           <description>Valid. The message object is configured and should be considered by the message handler</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_MCTRL</name>
               <description>Message interface 1 message control</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>DLC3_0</name>
                     <description>Data length code 3:0 The Data Length Code of a Message Object must be defined the same as in all the corresponding objects with the same identifier at other nodes. When the Message Handler stores a data frame, it will write the DLC to the value given by the received message. 0000 - 1000 = Data frame has 0 - 8 data bytes. 1001 - 1111 = Data frame has 8 data bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EOB</name>
                     <description>End of buffer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOT_END_OF_BUFFER</name>
                           <description>Not end of buffer. Message object belongs to a FIFO buffer and is not the last message object of that FIFO buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>END_OF_BUFFER</name>
                           <description>End of buffer. Single message object or last message object of a FIFO buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXRQST</name>
                     <description>Transmit request</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOT_WAITING</name>
                           <description>Not waiting. This message object is not waiting for transmission</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAITING</name>
                           <description>Waiting. The transmission of this message object is requested and is not yet done</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RMTEN</name>
                     <description>Remote enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>TXRQST_UNCHANGED</name>
                           <description>TXRQST unchanged. At the reception of a remote frame, TXRQST is left unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXRQST_SET</name>
                           <description>TXRQST set. At the reception of a remote frame, TXRQST is set</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXIE</name>
                     <description>Receive interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INTPND_UNCHANGED</name>
                           <description>INTPND unchanged. INTPND will be left unchanged after successful reception of a frame</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTPND_SET</name>
                           <description>INTPND set. INTPND will be set after successful reception of a frame</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXIE</name>
                     <description>Transmit interrupt enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INTPND_UNCHANGED</name>
                           <description>INTPND unchanged. The INTPND bit will be left unchanged after a successful transmission of a frame</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTPND_SET</name>
                           <description>INTPND set. INTPND will be set after a successful transmission of a frame</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UMASK</name>
                     <description>Use acceptance mask If UMASK is set to 1, the message object&apos;s mask bits have to be programmed during initialization of the message object before MAGVAL is set to 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IGNORE</name>
                           <description>Ignore. Mask ignored</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USE</name>
                           <description>Use. Use mask (MSK[28:0], MXTD, and MDIR) for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INTPND</name>
                     <description>Interrupt pending</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOT_PENDING</name>
                           <description>Not pending. This message object is not the source of an interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PENDING</name>
                           <description>Pending. This message object is the source of an interrupt. The Interrupt Identifier in the Interrupt Register will point to this message object if there is no other interrupt source with higher priority</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSGLST</name>
                     <description>Message lost (only valid for message objects in the direction receive)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOT_LOST</name>
                           <description>Not lost. No message lost since this bit was reset last by the CPU</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOST</name>
                           <description>Lost. The Message Handler stored a new message into this object when NEWDAT was still set, the CPU has lost a message</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NEWDAT</name>
                     <description>New data</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_NEW_DATA</name>
                           <description>No new data. No new data has been written into the data portion of this message object by the message handler since this flag was cleared last by the CPU</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEW_DATA</name>
                           <description>New data. The message handler or the CPU has written new data into the data portion of this message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DA1</name>
               <description>Message interface 1 data A1</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>DATA0</name>
                     <description>Data byte 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA1</name>
                     <description>Data byte 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DA2</name>
               <description>Message interface 1 data A2</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>DATA2</name>
                     <description>Data byte 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA3</name>
                     <description>Data byte 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DB1</name>
               <description>Message interface 1 data B1</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>DATA4</name>
                     <description>Data byte 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA5</name>
                     <description>Data byte 5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DB2</name>
               <description>Message interface 1 data B2</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>DATA6</name>
                     <description>Data byte 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA7</name>
                     <description>Data byte 7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="CANIF1_CMDREQ"> <name>CANIF2_CMDREQ</name> <addressOffset>0x80</addressOffset> </register>
            <register derivedFrom="CANIF1_CMDMSK_R"> <name>CANIF2_CMDMSK_R</name> <addressOffset>0x84</addressOffset> </register>
            <register derivedFrom="CANIF1_CMDMSK_W"> <name>CANIF2_CMDMSK_W</name> <addressOffset>0x84</addressOffset> </register>
            <register derivedFrom="CANIF1_MSK1"> <name>CANIF2_MSK1</name> <addressOffset>0x88</addressOffset> </register>
            <register derivedFrom="CANIF1_MSK2"> <name>CANIF2_MSK2</name> <addressOffset>0x8C</addressOffset> </register>
            <register derivedFrom="CANIF1_ARB1"> <name>CANIF2_ARB1</name> <addressOffset>0x90</addressOffset> </register>
            <register derivedFrom="CANIF1_ARB2"> <name>CANIF2_ARB2</name> <addressOffset>0x94</addressOffset> </register>
            <register derivedFrom="CANIF1_MCTRL"> <name>CANIF2_MCTRL</name> <addressOffset>0x98</addressOffset> </register>
            <register derivedFrom="CANIF1_DA1"> <name>CANIF2_DA1</name> <addressOffset>0x9C</addressOffset> </register>
            <register derivedFrom="CANIF1_DA2"> <name>CANIF2_DA2</name> <addressOffset>0xA0</addressOffset> </register>
            <register derivedFrom="CANIF1_DB1"> <name>CANIF2_DB1</name> <addressOffset>0xA4</addressOffset> </register>
            <register derivedFrom="CANIF1_DB2"> <name>CANIF2_DB2</name> <addressOffset>0xA8</addressOffset> </register>
            <register>
               <name>CANTXREQ1</name>
               <description>Transmission request 1</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRQST16_1</name>
                     <description>Transmission request bit of message objects 16 to 1. 0 = This message object is not waiting for transmission. 1 = The transmission of this message object is requested and not yet done</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANTXREQ2</name>
               <description>Transmission request 2</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRQST32_17</name>
                     <description>Transmission request bit of message objects 32 to 17. 0 = This message object is not waiting for transmission. 1 = The transmission of this message object is requested and not yet done</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
