podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/C_CAN_LPC11Cxx.svd.xml
            <register>
               <name>CANND1</name>
               <description>New data 1</description>
               <addressOffset>0x120</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NEWDAT16_1</name>
                     <description>New data bits of message objects 16 to 1. 0 = No new data has been written into the data portion of this Message Object by the Message Handler since last time this flag was cleared by the CPU. 1 = The Message Handler or the CPU has written new data into the data portion of this Message Object</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANND2</name>
               <description>New data 2</description>
               <addressOffset>0x124</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NEWDAT32_17</name>
                     <description>New data bits of message objects 32 to 17. 0 = No new data has been written into the data portion of this Message Object by the Message Handler since last time this flag was cleared by the CPU. 1 = The Message Handler or the CPU has written new data into the data portion of this Message Object</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIR1</name>
               <description>Interrupt pending 1</description>
               <addressOffset>0x140</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTPND16_1</name>
                     <description>Interrupt pending bits of message objects 16 to 1. 0 = This message object is ignored by the message handler. 1 = This message object is the source of an interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIR2</name>
               <description>Interrupt pending 2</description>
               <addressOffset>0x144</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTPND32_17</name>
                     <description>Interrupt pending bits of message objects 32 to 17. 0 = This message object is ignored by the message handler. 1 = This message object is the source of an interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANMSGV1</name>
               <description>Message valid 1</description>
               <addressOffset>0x160</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MSGVAL16_1</name>
                     <description>Message valid bits of message objects 16 to 1. 0 = This message object is ignored by the message handler. 1 = This message object is configured and should be considered by the message handler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANMSGV2</name>
               <description>Message valid 2</description>
               <addressOffset>0x164</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MSGVAL32_17</name>
                     <description>Message valid bits of message objects 32 to 17. 0 = This message object is ignored by the message handler. 1 = This message object is configured and should be considered by the message handler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANCLKDIV</name>
               <description>Can clock divider register</description>
               <addressOffset>0x180</addressOffset>
               <fields>
                  <field>
                     <name>CLKDIVVAL</name>
                     <description>Clock divider value. CAN_CLK =  PCLK/(CLKDIVVAL +1) 0000: CAN_CLK = PCLK divided by 1. 0001: CAN_CLK = PCLK divided by 2. 0010: CAN_CLK = PCLK divided by 3 0011: CAN_CLK = PCLK divided by 4. ... 1111: CAN_CLK = PCLK divided by 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
